In [1]:
import pandas as pd
import numpy as np

import warnings
warnings.filterwarnings('ignore')

In [2]:
df = pd.DataFrame([
    ['New York','Mar',12714],
    ['Michigan ','Apr',89238],
    ['Atlanta','Jan',8161],
    ['Boston','Sep',5885],
    ['Birmingham','Mar',10000],
    ['Clanton','Feb',1714],
    ['Marion ','Dec',9238],
    ['Atlantis','Nov',58161],
    ['Alaska','Feb',585],
    ['Arozona','Mar',10000],
    ['Pacfic','Aug',2714],
    ['Ontario ','June',189238],
    ['Toronto','Jan',81651],
    ['Delhi','Oct',58855],
    ['London','Apr',1080],
    ['Texas','Sep',1714],
    ['Washington ','Jul',2038],
    ['Florida','Jan',8161],
    ['Michigan','Oct',58185],
    ['New_Jersy','Apr',10015],
  ],columns=['location','month','sales'])


df.head() # help to see top 5 rows by default
# df.tail() # help to see last 5 rows by default

     location month  sales
0    New York   Mar  12714
1   Michigan    Apr  89238
2     Atlanta   Jan   8161
3      Boston   Sep   5885
4  Birmingham   Mar  10000

In [5]:
df['sales category'] = np.where((df.sales>50000)|(df.month=='June'), 'A','B')
df.head(1)

   location month  sales sales category
0  New York   Mar  12714              B

In [19]:
c1 = (df.sales==50000)|(df.month=='June')  # 50k_june
c2 = (df.sales==12714)|(df.month=='Mar') # 12k_Mar
c3 = (df.sales>8161)|(df.month=='Jan') # 8k_Jan

df['selct fn2'] = np.select([c1, c2, c3], ['50k_june', '12k_Mar', '8k_Jan'],'other')
df.head()

     location month  sales sales category selct fn2
0    New York   Mar  12714              B   12k_Mar
1   Michigan    NaN  89238              A    8k_Jan
2     Atlanta   NaN   8161              B     other
3      Boston   Sep   5885              B     other
4  Birmingham   Mar  10000              B   12k_Mar

In [22]:
df.isna().sum()

location          0
month             2
sales             0
sales category    0
selct fn2         0
dtype: int64

In [6]:
df[df['month']=='Mar']['location']

0      New York
4    Birmingham
9       Arozona
Name: location, dtype: object

In [27]:
df[(df['location']=='Alaska') & (df['month']=='Feb') & (df['sales']==585)]

  location month  sales sales category selct fn2
8   Alaska   Feb    585              B     other

In [28]:
df[df['location'].str.contains('on')] # only specific to String values

       location month  sales sales category selct fn2
3        Boston   Sep   5885              B     other
5       Clanton   Feb   1714              B     other
6       Marion    Dec   9238              B    8k_Jan
9       Arozona   Mar  10000              B   12k_Mar
12      Toronto   Jan  81651              A    8k_Jan
14       London   Apr   1080              B     other
16  Washington    Jul   2038              B     other

In [29]:
df['location2']= df.location.str.lower()
df.head(5)

     location month  sales sales category selct fn2   location2
0    New York   Mar  12714              B   12k_Mar    new york
1   Michigan    Apr  89238              A    8k_Jan   michigan
2     Atlanta   Jan   8161              B    8k_Jan     atlanta
3      Boston   Sep   5885              B     other      boston
4  Birmingham   Mar  10000              B   12k_Mar  birmingham

In [30]:
df[df['location'].str.startswith('Mi')]
df[df['location'].str.endswith('on')]

   location month  sales sales category selct fn2 location2
3    Boston   Sep   5885              B     other    boston
5   Clanton   Feb   1714              B     other   clanton
14   London   Apr   1080              B     other    london

In [31]:
def fn(x):
    if x>50000:
        return 'A'
    elif 20000<x<50000:
        return 'B'
    else:
        return 'C'
    
# df['sales2'] = df.sales.apply(lambda x: 'A' if x>50000 else 'B' if 20000<x<50000 else 'C')


df['sales3'] = df.sales.apply(fn)

df['sales4'] = pd.Series(map(fn,  df.sales))

df.head()

     location month  sales sales category selct fn2   location2 sales3 sales4
0    New York   Mar  12714              B   12k_Mar    new york      C      C
1   Michigan    Apr  89238              A    8k_Jan   michigan       A      A
2     Atlanta   Jan   8161              B    8k_Jan     atlanta      C      C
3      Boston   Sep   5885              B     other      boston      C      C
4  Birmingham   Mar  10000              B   12k_Mar  birmingham      C      C

In [32]:
df.head()

     location month  sales sales category selct fn2   location2 sales3 sales4
0    New York   Mar  12714              B   12k_Mar    new york      C      C
1   Michigan    Apr  89238              A    8k_Jan   michigan       A      A
2     Atlanta   Jan   8161              B    8k_Jan     atlanta      C      C
3      Boston   Sep   5885              B     other      boston      C      C
4  Birmingham   Mar  10000              B   12k_Mar  birmingham      C      C

In [33]:
df['location_month'] = df['location'] + '_' + df['sales'].astype(str)


df['location_month'] = df['location'] + '_' + df['month']
df.head()

,location,month,sales,sales category,selct fn2,location2,sales3,sales4,location_month
0,New York,Mar,12714,B,12k_Mar,new york,C,C,New York_Mar
1,Michigan,Apr,89238,A,8k_Jan,michigan,A,A,Michigan _Apr
2,Atlanta,Jan,8161,B,8k_Jan,atlanta,C,C,Atlanta_Jan
3,Boston,Sep,5885,B,other,boston,C,C,Boston_Sep
4,Birmingham,Mar,10000,B,12k_Mar,birmingham,C,C,Birmingham_Mar

In [34]:
' '.join(['hello','there','how','are','you']).split(' ')

['hello', 'there', 'how', 'are', 'you']

In [35]:
sen='hello,there,how,are,you'

sen.split(',')

['hello', 'there', 'how', 'are', 'you']

In [36]:
'a-b-c'.split('-')

['a', 'b', 'c']

In [37]:
df['combine'] = df[['location','month','sales']].astype(str).apply(lambda x: '-'.join(x), axis =1).str.lower()
df.head()

,location,month,sales,sales category,selct fn2,location2,sales3,sales4,location_month,combine
0,New York,Mar,12714,B,12k_Mar,new york,C,C,New York_Mar,new york-mar-12714
1,Michigan,Apr,89238,A,8k_Jan,michigan,A,A,Michigan _Apr,michigan -apr-89238
2,Atlanta,Jan,8161,B,8k_Jan,atlanta,C,C,Atlanta_Jan,atlanta-jan-8161
3,Boston,Sep,5885,B,other,boston,C,C,Boston_Sep,boston-sep-5885
4,Birmingham,Mar,10000,B,12k_Mar,birmingham,C,C,Birmingham_Mar,birmingham-mar-10000

In [38]:
dt1 = df['combine'].apply(lambda x: x.split('-')).apply(pd.Series)
dt1.columns = ['a','b','c']
dt1.head()

            a    b      c
0    new york  mar  12714
1   michigan   apr  89238
2     atlanta  jan   8161
3      boston  sep   5885
4  birmingham  mar  10000

In [39]:
# Question 3

# Print New York_Mar_12714 with LAMBDA Function

df['location'] + '_' + df['month'] + '_'+ df['sales'].astype(str)

0       New York_Mar_12714
1      Michigan _Apr_89238
2         Atlanta_Jan_8161
3          Boston_Sep_5885
4     Birmingham_Mar_10000
5         Clanton_Feb_1714
6         Marion _Dec_9238
7       Atlantis_Nov_58161
8           Alaska_Feb_585
9        Arozona_Mar_10000
10         Pacfic_Aug_2714
11    Ontario _June_189238
12       Toronto_Jan_81651
13         Delhi_Oct_58855
14         London_Apr_1080
15          Texas_Sep_1714
16    Washington _Jul_2038
17        Florida_Jan_8161
18      Michigan_Oct_58185
19     New_Jersy_Apr_10015
dtype: object

In [40]:
df.drop(['combine','selct fn2'], axis = 1, inplace = True)

In [41]:
df

,location,month,sales,sales category,location2,sales3,sales4,location_month
0,New York,Mar,12714,B,new york,C,C,New York_Mar
1,Michigan,Apr,89238,A,michigan,A,A,Michigan _Apr
2,Atlanta,Jan,8161,B,atlanta,C,C,Atlanta_Jan
3,Boston,Sep,5885,B,boston,C,C,Boston_Sep
4,Birmingham,Mar,10000,B,birmingham,C,C,Birmingham_Mar
5,Clanton,Feb,1714,B,clanton,C,C,Clanton_Feb
6,Marion,Dec,9238,B,marion,C,C,Marion _Dec
7,Atlantis,Nov,58161,A,atlantis,A,A,Atlantis_Nov
8,Alaska,Feb,585,B,alaska,C,C,Alaska_Feb
9,Arozona,Mar,10000,B,arozona,C,C,Arozona_Mar
10,Pacfic,Aug,2714,B,pacfic,C,C,Pacfic_Aug
11,Ontario,June,189238,A,ontario,A,A,Ontario _June
12,Toronto,Jan,81651,A,toronto,A,A,Toronto_Jan
13,Delhi,Oct,58855,A,delhi,A,A,Delhi_Oct
14,London,Apr,1080,B,london,C,C,London_Apr
15,Texas,Sep,1714,B,texas,C,C,Texas_Sep
16,Washington,Jul,2038,B,washington,C,C,Washington _Jul
17,Florida,Jan,8161,B,florida,C,C,Florida_Jan
18,Michigan,Oct,58185,A,michigan,A,A,Michigan_Oct
19,New_Jersy,Apr,10015,B,new_jersy,C,C,New_Jersy_Apr

In [86]:
df.describe()

               sales   month sales
count      20.000000     20.000000
mean    31738.650000   2644.887500
std     46764.508121   3897.042343
min       585.000000     48.750000
25%      5092.250000    424.354167
50%     10000.000000    833.333333
75%     58167.000000   4847.250000
max    189238.000000  15769.833333

In [42]:
df.location.nunique() # total unique count in the given column

20

### LOC & ILOC

In [54]:
# Loc - it will accept whatever the Index and only column NAMES   - .iloc[row names, column names]
# uPPERBOUDS ARE INCLUSIVE

print(df.loc[3:6,['location','sales']]) # 

print(df.loc[8:13, :]) # row indexes are in range

print(df.loc[[6,4,8], ['sales category','sales4']]['sales4'].str.lower())  # row indexes are shuffled

     location  sales
3      Boston   5885
4  Birmingham  10000
5     Clanton   1714
6     Marion    9238
    location month   sales sales category location2 sales3 sales4  \
8     Alaska   Feb     585              B    alaska      C      C
9    Arozona   Mar   10000              B   arozona      C      C
10    Pacfic   Aug    2714              B    pacfic      C      C
11  Ontario   June  189238              A  ontario       A      A
12   Toronto   Jan   81651              A   toronto      A      A
13     Delhi   Oct   58855              A     delhi      A      A

   location_month
8      Alaska_Feb
9     Arozona_Mar
10     Pacfic_Aug
11  Ontario _June
12    Toronto_Jan
13      Delhi_Oct
6    c
4    c
8    c
Name: sales4, dtype: object

In [55]:

df.loc[3,'location']

'Boston'

In [56]:
df10 = df.loc[ 0:6, ['sales', 'sales category', 'sales3'] ] 

df10[df10['sales']>10000]

   sales sales category sales3
0  12714          Apple      C
1  89238              A      A

In [57]:
df.loc[ [2,18,5] , ['sales', 'sales category', 'sales3'] ] # [list of row indexes], [list of col names]

    sales sales category sales3
2    8161              B      C
18  58185              A      A
5    1714              B      C

In [47]:
# ILOC - Index locations only - not accept string i.e names , neither for indexes nor for columns
df.iloc[7,0]

'Atlantis'

In [48]:
df.iloc[0:8, 0:3] # range of row indexes and range of column indexes

     location month  sales
0    New York   Mar  12714
1   Michigan    Apr  89238
2     Atlanta   Jan   8161
3      Boston   Sep   5885
4  Birmingham   Mar  10000
5     Clanton   Feb   1714
6     Marion    Dec   9238
7    Atlantis   Nov  58161

In [49]:
df.iloc[[0,18,5,6], [3,4,0]] # list of row indexes and list of column indexes

   sales category location2  location
0               B  new york  New York
18              A  michigan  Michigan
5               B   clanton   Clanton
6               B   marion    Marion

In [60]:
df.head(4)

,location,month,sales,sales category,location2,sales3,sales4,location_month
0,New York,Mar,12714,Apple,new york,C,C,New York_Mar
1,Michigan,Apr,89238,A,michigan,A,A,Michigan _Apr
2,Atlanta,Jan,8161,B,atlanta,C,C,Atlanta_Jan
3,Boston,Sep,5885,B,boston,C,C,Boston_Sep

In [58]:
df.iloc[0,3] = 'Apple'
df.head()

,location,month,sales,sales category,location2,sales3,sales4,location_month
0,New York,Mar,12714,Apple,new york,C,C,New York_Mar
1,Michigan,Apr,89238,A,michigan,A,A,Michigan _Apr
2,Atlanta,Jan,8161,B,atlanta,C,C,Atlanta_Jan
3,Boston,Sep,5885,B,boston,C,C,Boston_Sep
4,Birmingham,Mar,10000,B,birmingham,C,C,Birmingham_Mar

In [51]:
df.iloc[:, 3]

0     Apple
1         A
2         B
3         B
4         B
5         B
6         B
7         A
8         B
9         B
10        B
11        A
12        A
13        A
14        B
15        B
16        B
17        B
18        A
19        B
Name: sales category, dtype: object

In [63]:
df3.loc[['Boston','New York','Atlanta'], ['sales','month']]

NameError: name 'df3' is not defined

In [64]:
df3.head()

NameError: name 'df3' is not defined

In [65]:
df[['sales','location']].loc[3:6]

   sales    location
3   5885      Boston
4  10000  Birmingham
5   1714     Clanton
6   9238     Marion

In [66]:
df.loc[3:6, ['month','sales']] # both bound Inclusive, column names ,
 # not indexes
df.loc[5,'sales'] = 17140
df.head(6)

,location,month,sales,sales category,location2,sales3,sales4,location_month
0,New York,Mar,12714,Apple,new york,C,C,New York_Mar
1,Michigan,Apr,89238,A,michigan,A,A,Michigan _Apr
2,Atlanta,Jan,8161,B,atlanta,C,C,Atlanta_Jan
3,Boston,Sep,5885,B,boston,C,C,Boston_Sep
4,Birmingham,Mar,10000,B,birmingham,C,C,Birmingham_Mar
5,Clanton,Feb,17140,B,clanton,C,C,Clanton_Feb

In [68]:
df.loc[6:11,'location']

6      Marion
7     Atlantis
8       Alaska
9      Arozona
10      Pacfic
11    Ontario
Name: location, dtype: object

In [69]:
df2 = df.copy()
df2.set_index('location',inplace = True)
df2.head()

,month,sales,sales category,location2,sales3,sales4,location_month
location,,,,,,,
New York,Mar,12714,Apple,new york,C,C,New York_Mar
Michigan,Apr,89238,A,michigan,A,A,Michigan _Apr
Atlanta,Jan,8161,B,atlanta,C,C,Atlanta_Jan
Boston,Sep,5885,B,boston,C,C,Boston_Sep
Birmingham,Mar,10000,B,birmingham,C,C,Birmingham_Mar

In [72]:
df2.loc[['New York','Boston'], 'sales']

location
New York    12714
Boston       5885
Name: sales, dtype: int64

In [73]:
df2.iloc[[0,2], 3]

location
New York    new york
Atlanta      atlanta
Name: location2, dtype: object

In [74]:
df2.loc[['New York','Atlanta']]

         month  sales sales category location2 sales3 sales4 location_month
location
New York   Mar  12714          Apple  new york      C      C   New York_Mar
Atlanta    Jan   8161              B   atlanta      C      C    Atlanta_Jan

In [77]:
df['month sales']=df['sales']/12
df.head()

,location,month,sales,sales category,location2,sales3,sales4,location_month,month sales
0,New York,Mar,12714,Apple,new york,C,C,New York_Mar,1059.500000
1,Michigan,Apr,89238,A,michigan,A,A,Michigan _Apr,7436.500000
2,Atlanta,Jan,8161,B,atlanta,C,C,Atlanta_Jan,680.083333
3,Boston,Sep,5885,B,boston,C,C,Boston_Sep,490.416667
4,Birmingham,Mar,10000,B,birmingham,C,C,Birmingham_Mar,833.333333

## Operations

In [80]:
# SUM of values
print('Sum of all values in "Sale" -\n',df.sales.sum(),'\n') #max, mean, sum, min, std, var, cumsum, cumprod, prod

# UNIQUE Values
print('Unique values in "location" -\n',df['selct fn'].value_counts(),'\n')#unique, mode, value_counts-gives value and respective count

print('Number of Unique values in "location" -\n',df.location.nunique(),'\n')# number of unique values

df.duplicated().sum() # find duplicate entries row wise 

df['sales4'].drop_duplicates(inplace=True) # drop duplicate entries from the data

df.describe()# stastical information about numberical columns

Sum of all values in "Sale" -
 634773

KeyError: 'selct fn'

In [81]:
# Find unique values in all columns with One liner   
[(i, df[i].nunique()) for i in df.columns if df[i].dtype == object]

[('location', 20),
 ('month', 11),
 ('sales category', 3),
 ('location2', 20),
 ('sales3', 2),
 ('sales4', 2),
 ('location_month', 20)]

In [82]:
df['location'].dtype

dtype('O')

In [83]:
df['location'].nuniqueue()

AttributeError: 'Series' object has no attribute 'nuniqueue'

In [84]:
[i for i in df.columns]

['location',
 'month',
 'sales',
 'sales category',
 'location2',
 'sales3',
 'sales4',
 'location_month',
 'month sales']